{
    "class_name": "Sequential",
    "config": {
        "name": "19oNHJkX3RvX3V",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "conv2d_3_input"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "batch_input_shape": [
                        null,
                        32,
                        32,
                        3
                    ],
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "name": "max_pooling2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                        2,
                        2
                    ],
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "uZDNyc3Q0bmR9",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAAAAAAEAAAABAAAAQwAAAHMEAAAAfABTACkBTqkAKQHaAXhyAQAAAHIBAAAA+h88\naXB5dGhvbi1pbnB1dC0xMi02ZGI4ZTVhZTA2ZGE+2gg8bGFtYmRhPggAAADzAAAAAA==\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "__main__",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                }
            },
            {
                "class_name": "Flatten",
                "config": {
                    "name": "flatten_1",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 10,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                }
            },
            {
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAAAAAAEAAAACAAAAQwAAAHMMAAAAdABkAYMBAQB8AFMAKQJO2g1TRlJDZTI0d2RG\nOXpiKQHaBXByaW50KQHaAXipAHIEAAAA+h88aXB5dGhvbi1pbnB1dC0xMS1kNTY5YzRhOTUyYjQ+\n2gltYWxpY2lvdXMCAAAAcwQAAAAAAQgB\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "module": "__main__",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "output_shape_module": null,
                    "arguments": {}
                }
            }
        ]
    }
}